package com.javarush.task.task05.task0528;

/* 
Вывести на экран текущую дату в аналогичном виде «21 02 2014«.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("09 07 2017");
    }
}
